In [2]:
import pandas as pd 
import numpy as np

In [3]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [4]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [6]:
frame = pd.DataFrame(data, columns=['year', 'state', 'pop'])
frame

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [8]:
# Retreving Columns
frame['year']

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [10]:
# Retreving Rows
frame.loc[3]

year       2001
state    Nevada
pop         2.4
Name: 3, dtype: object

In [11]:
 frame = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'])
frame

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [12]:
frame['debt'] = np.arange(6.)

In [13]:
frame

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [14]:
del frame['debt']
frame

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [15]:
frame.T

          0     1     2       3       4       5
year   2000  2001  2002    2001    2002    2003
state  Ohio  Ohio  Ohio  Nevada  Nevada  Nevada
pop     1.5   1.7   3.6     2.4     2.9     3.2

In [16]:
frame = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=["a","b","c","d","e","f"])

frame

   year   state  pop debt
a  2000    Ohio  1.5  NaN
b  2001    Ohio  1.7  NaN
c  2002    Ohio  3.6  NaN
d  2001  Nevada  2.4  NaN
e  2002  Nevada  2.9  NaN
f  2003  Nevada  3.2  NaN

In [17]:
frame["debt"] = 5
frame

   year   state  pop  debt
a  2000    Ohio  1.5     5
b  2001    Ohio  1.7     5
c  2002    Ohio  3.6     5
d  2001  Nevada  2.4     5
e  2002  Nevada  2.9     5
f  2003  Nevada  3.2     5

In [26]:
frame2 = frame
frame2

   year   state  pop  debt
a  2000    Ohio  1.5     5
b  2001    Ohio  1.7     5
c  2002    Ohio  3.6     5
d  2001  Nevada  2.4     5
e  2002  Nevada  2.9     5
f  2003  Nevada  3.2     5

In [28]:
frame2.reindex(["aa","bb","cc","dd","ee","ff"])

    year state  pop  debt
aa   NaN   NaN  NaN   NaN
bb   NaN   NaN  NaN   NaN
cc   NaN   NaN  NaN   NaN
dd   NaN   NaN  NaN   NaN
ee   NaN   NaN  NaN   NaN
ff   NaN   NaN  NaN   NaN